{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_1", "filters": 32, "kernel_regularizer": null, "kernel_size": [5, 5], "strides": [1, 1], "dtype": "float32", "use_bias": true, "padding": "valid", "batch_input_shape": [null, 42, 42, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_2", "filters": 32, "kernel_regularizer": null, "kernel_size": [4, 4], "activity_regularizer": null, "use_bias": true, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_3", "filters": 32, "kernel_regularizer": null, "kernel_size": [5, 5], "activity_regularizer": null, "use_bias": true, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 3072}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 7}}], "class_name": "Sequential"}