{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "batch_input_shape": [null, 42, 42, 1], "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [5, 5], "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_2", "filters": 32, "kernel_size": [4, 4], "use_bias": true, "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_3", "filters": 32, "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "name": "dense_1", "units": 3072, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "name": "dense_2", "units": 7, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}