{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 42, 42, 1], "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "filters": 32, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "filters": 32, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 3072, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "units": 7, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "softmax", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null}}]}