{"keras_version": "2.0.2", "config": [{"config": {"trainable": true, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 42, 42, 1], "name": "conv2d_1", "data_format": "channels_last", "padding": "valid", "filters": 32, "kernel_size": [5, 5], "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "padding": "valid", "filters": 32, "kernel_size": [4, 4], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "data_format": "channels_last", "padding": "valid", "filters": 32, "kernel_size": [5, 5], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "units": 3072, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "units": 7, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}