{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32, "activity_regularizer": null, "batch_input_shape": [null, 42, 42, 1], "activation": "relu", "bias_constraint": null, "padding": "valid", "name": "conv2d_1", "trainable": true, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "padding": "valid", "name": "conv2d_2", "trainable": true, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "padding": "valid", "name": "conv2d_3", "trainable": true, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 3072, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 7, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true}}], "keras_version": "2.0.2"}